package lesson_14;

import java.util.Arrays;

public class HomeWork_14_Task3 {
/*
Task 3 * (Опционально)
Найти второе по величине число в массиве
Напишите метод, который находит второе по величине число в массиве целых чисел.
 */

    public static void main(String[] args) {

        int[] array = {6, 0, 8, 10, 7, 3, 1, 1, 10, 6};
        System.out.println(Arrays.toString(array));


    } // main area

public static void secondBigNumber(int[] array) {

}





} // class area
