package lesson_31.enums;

public enum Color {

    // специфический класс - набор констант - и работы с ними
    // используется когда нужно жёстко ограничить выбор (дни недели, планеты,
    // статусы заказа, роли пользователя (обычный пользователь, администратор, модератор, заблокированный), )

    /*
    public static final String RED = "RED";
    значение константы соответствует её названию
    --------------------------------------------------------------------------------------
    правила именования констант:
    */

    RED,
    GREEN,
    BLUE





}
